ХМНПФ_Общее/DataProcessors/уп_ЗагрузкаУмершихОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ЗагрузкаУмершихОПС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговораОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияДоговоровОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПричиныЗакрытияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияДоговоровОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПричиныЗакрытияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговоровОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПодтвержденияПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПоступленияВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриостановленПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбязательстваВыполнены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Анулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ПричиныЗакрытияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияДоговораОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоСмерти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Досрочное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакрытПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АннулированиеЛицензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеВступилВСилу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоРешениюСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходДосрочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоИнымПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъединениеСНИЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ПереносСредствНаДругойДоговорФизЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_НазначенаВыплатаПредыдущимСтраховщиком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_ЗагрузкаУмершихОПС/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения()

	// ХМНПФ 09.03.2016 Шадрин А.В. // ЗагрузитьТаблицу() // №261
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗагрузитьТаблицу")
Процедура ХМЗагрузитьТаблицу(ТЗ, Протокол)
	//есть только СНИЛС
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабДляЗагрузки.СНИЛС,
	|	ТабДляЗагрузки.ФИО,
	|	ТабДляЗагрузки.Нпп,
	|	ТабДляЗагрузки.ДатаСмерти
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	&ТабДляЗагрузки КАК ТабДляЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходныеДанные.СНИЛС КАК СНИЛС,
	|	ИсходныеДанные.ФИО КАК ФИО,
	|	ИсходныеДанные.ДатаСмерти,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник КАК ЗЛ,
	|	уп_СостоянияДоговораОПССрезПоследних.Состояние,
	|	ИсходныеДанные.Нпп КАК Нпп,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Код КАК ДоговорНомер,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.ДатаЗаключения КАК ДоговорДата,
	|	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(
	|				&ДатаДок,
	|				ДоговорОПС.Организация = &Организация
	|					И ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР В (&СписокСНИЛС)) КАК уп_СостоянияДоговораОПССрезПоследних
	|		ПО ИсходныеДанные.СНИЛС = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(
	|				&ДатаДок,
	|				ДоговорОПС.Организация = &Организация
	|					И ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР В (&СписокСНИЛС)) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
	|		ПО ИсходныеДанные.СНИЛС = уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР
	|
	|УПОРЯДОЧИТЬ ПО
	|	Нпп,
	|	ДоговорДата УБЫВ
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоговорОПС)
	|ПО
	|	СНИЛС";

	Запрос.УстановитьПараметр("ДатаДок", ДокументОснование.Дата);
	Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
	Запрос.УстановитьПараметр("ТабДляЗагрузки", ТЗ);
	Запрос.УстановитьПараметр("СписокСНИЛС", ТЗ.ВыгрузитьКолонку("СНИЛС"));

	Результат = Запрос.Выполнить();
	#Если Клиент Тогда
		Состояние("Поиск соответствий в базе данных");
	#КонецЕсли
	СписокДействующихСостояний = Новый СписокЗначений;
	СписокДействующихСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);
	СписокДействующихСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод);
	СписокДействующихСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены);
	СписокДействующихСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены);
	СписокДействующихСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ЕдиновременнаяВыплата);
	СписокДействующихСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ОбязательстваВыполнены);
	СписокДействующихСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию);

	ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаИтоги.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество()<=1 Тогда
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				#Если Клиент Тогда
					Состояние(ВыборкаДетальныеЗаписи.Нпп);
				#КонецЕсли
				Если ВыборкаДетальныеЗаписи.ДоговорОПС = NULL Тогда //не найден договор
					Протокол.ДобавитьСтроку("Не найден договор об ОПС с "+ВыборкаДетальныеЗаписи.ФИО+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС);
				Иначе //все в порядке
					Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда
						Протокол.ДобавитьСтроку("Договор №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" уже закрыт и не будет внесен в табличную часть!");
						Продолжить;
					ИначеЕсли ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию
						и ВыборкаДетальныеЗаписи.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
						#Удаление 
						Протокол.ДобавитьСтроку("Договор №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" уже находится в состоянии подготовка к закрытию по смерти и не будет внесен в табличную часть!");
						Продолжить;							
						#КонецУдаления 
						#Вставка 
						// +ХМНПФ 09.03.2016 Шадрин А.В. // ЗагрузитьТаблицу() // №261
						Протокол.ДобавитьСтроку("Договор №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" уже находится в состоянии подготовка к закрытию по смерти.");
						// -ХМНПФ 09.03.2016 Шадрин А.В. // ЗагрузитьТаблицу() // №261
						#КонецВставки
					КонецЕсли;	

					ДобавитьСтроку(ВыборкаДетальныеЗаписи.ДоговорОПС,ВыборкаДетальныеЗаписи.ЗЛ,ВыборкаДетальныеЗаписи.ДатаСмерти);
				КонецЕсли;
			Иначе
				Протокол.ДобавитьСтроку("Не найден ЗЛ "+ВыборкаИтоги.СНИЛС);
			КонецЕсли;
		Иначе
			ТекДоговор = Неопределено;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СНИЛС = ВыборкаДетальныеЗаписи.СНИЛС;
				Если  СписокДействующихСостояний.НайтиПоЗначению(ВыборкаДетальныеЗаписи.Состояние)<>Неопределено Тогда
					ТекДоговор = ВыборкаДетальныеЗаписи.ДоговорОПС;
					ДобавитьСтроку(ВыборкаДетальныеЗаписи.ДоговорОПС,ВыборкаДетальныеЗаписи.ЗЛ,ВыборкаДетальныеЗаписи.ДатаСмерти);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ТекДоговор = Неопределено Тогда
				Протокол.ДобавитьСтроку("По ЗЛ "+ВыборкаИтоги.СНИЛС+" не найдено ни одного действующего договора.");
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
